Tekla Open API Reference for Tekla Structures 2025
OBB.Equals Method
Overload List
Name | Description
Equals(Object)
 Tests for the exact equality of two OBBs.
 (Overrides Object.Equals(Object).)
Equals(OBB)
 Tests for the exact equality of two OBBs.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace